In [1]:
import pandas as pd
import numpy as np

clients = pd.read_csv('clients.csv')
prets = pd.read_csv('prets.csv')

prets.head()

,identifiant,ville,CP,revenu,remboursement,duree,type,taux
0,0,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168
1,1,PARIS,75009,5310.0,240.00,64,automobile,3.701
2,1,PARIS,75009,5310.0,1247.85,300,immobilier,1.173
3,2,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972
4,3,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014

In [2]:
clients.head()

   identifiant                      email               nom genre
0            0  LaurentDagenais@rhyta.com  Laurent Dagenais     M
1            1      GuyMarois@fleckens.hu        Guy Marois     M
2            2  BeaufortLesage@einrot.com   Beaufort Lesage     M
3            3  RussellDurand@armyspy.com    Russell Durand     M
4            4       AlexisRiel@rhyta.com       Alexis Riel     M

In [3]:
groupe = pd.merge(clients, prets, on='identifiant')
groupe.head()

,identifiant,email,nom,genre,ville,CP,revenu,remboursement,duree,type,taux
0,0,LaurentDagenais@rhyta.com,Laurent Dagenais,M,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168
1,1,GuyMarois@fleckens.hu,Guy Marois,M,PARIS,75009,5310.0,240.00,64,automobile,3.701
2,1,GuyMarois@fleckens.hu,Guy Marois,M,PARIS,75009,5310.0,1247.85,300,immobilier,1.173
3,2,BeaufortLesage@einrot.com,Beaufort Lesage,M,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972
4,3,RussellDurand@armyspy.com,Russell Durand,M,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014

In [4]:
clients2 = clients
clients2.rename(columns={'identifiant':'ide'}, inplace=True)
clients2

     ide                            email                nom genre
0      0        LaurentDagenais@rhyta.com   Laurent Dagenais     M
1      1            GuyMarois@fleckens.hu         Guy Marois     M
2      2        BeaufortLesage@einrot.com    Beaufort Lesage     M
3      3        RussellDurand@armyspy.com     Russell Durand     M
4      4             AlexisRiel@rhyta.com        Alexis Riel     M
..   ...                              ...                ...   ...
223  223  ClaudeDandonneau@jourrapide.com  Claude Dandonneau     F
224  224    ApollineMichaud@superrito.com   Apolline Michaud     F
225  225       PascalineBeaudry@rhyta.com  Pascaline Beaudry     F
226  226     FleurCaouette@jourrapide.com     Fleur Caouette     F
227  227      FrancisMasse@jourrapide.com      Francis Masse     M

[228 rows x 4 columns]

In [5]:
clients2 = clients2.merge(prets, left_on='ide', right_on='identifiant')
clients2

,ide,email,nom,genre,identifiant,ville,CP,revenu,remboursement,duree,type,taux
0,0,LaurentDagenais@rhyta.com,Laurent Dagenais,M,0,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168
1,1,GuyMarois@fleckens.hu,Guy Marois,M,1,PARIS,75009,5310.0,240.00,64,automobile,3.701
2,1,GuyMarois@fleckens.hu,Guy Marois,M,1,PARIS,75009,5310.0,1247.85,300,immobilier,1.173
3,2,BeaufortLesage@einrot.com,Beaufort Lesage,M,2,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972
4,3,RussellDurand@armyspy.com,Russell Durand,M,3,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014
...,...,...,...,...,...,...,...,...,...,...,...,...
239,224,ApollineMichaud@superrito.com,Apolline Michaud,F,224,PARIS,75008,5118.0,1248.79,300,immobilier,1.206
240,224,ApollineMichaud@superrito.com,Apolline Michaud,F,224,PARIS,75008,5118.0,238.20,25,automobile,3.423
241,225,PascalineBeaudry@rhyta.com,Pascaline Beaudry,F,225,BORDEAUX,33100,2356.0,876.43,180,immobilier,1.172
242,226,FleurCaouette@jourrapide.com,Fleur Caouette,F,226,PARIS,75002,5098.0,2910.96,240,immobilier,1.140
243,227,FrancisMasse@jourrapide.com,Francis Masse,M,227,PARIS,75015,2348.0,434.38,300,immobilier,1.157

In [7]:
#groupe_left = pd.merge(clients, prets, on='identifiant', how='left')
#groupe_left.head()
clients.rename(columns={'ide':'identifiant'}, inplace=True)

In [8]:
groupe_left = pd.merge(clients, prets, on='identifiant', how='left')
groupe_left.head()

,identifiant,email,nom,genre,ville,CP,revenu,remboursement,duree,type,taux
0,0,LaurentDagenais@rhyta.com,Laurent Dagenais,M,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168
1,1,GuyMarois@fleckens.hu,Guy Marois,M,PARIS,75009,5310.0,240.00,64,automobile,3.701
2,1,GuyMarois@fleckens.hu,Guy Marois,M,PARIS,75009,5310.0,1247.85,300,immobilier,1.173
3,2,BeaufortLesage@einrot.com,Beaufort Lesage,M,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972
4,3,RussellDurand@armyspy.com,Russell Durand,M,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014

In [9]:
groupe_right = pd.merge(clients, prets, on='identifiant', how='right')
groupe_right.head()

,identifiant,email,nom,genre,ville,CP,revenu,remboursement,duree,type,taux
0,0,LaurentDagenais@rhyta.com,Laurent Dagenais,M,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168
1,1,GuyMarois@fleckens.hu,Guy Marois,M,PARIS,75009,5310.0,240.00,64,automobile,3.701
2,1,GuyMarois@fleckens.hu,Guy Marois,M,PARIS,75009,5310.0,1247.85,300,immobilier,1.173
3,2,BeaufortLesage@einrot.com,Beaufort Lesage,M,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972
4,3,RussellDurand@armyspy.com,Russell Durand,M,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014

In [ ]:
liste_concat = [df1, df2]

pd.concat(liste_concat, ignore_index=True)

In [11]:
notes = pd.read_csv('notes.csv')
notes.head()

                nom   matiere  note
0  Laurent Dagenais  Français    16
1        Guy Marois  Français    13
2   Beaufort Lesage  Français     8
3    Russell Durand  Français    10
4       Alexis Riel  Français    15

In [16]:
notes['matiere'].unique()

array(['Français', 'Mathématiques', 'Biologie', 'Physique/Chimie'],
      dtype=object)

In [17]:
notes['note'].unique()

array([16, 13,  8, 10, 15, 17,  6, 12, 19, 11,  7,  5, 18,  9, 14])

In [23]:
doublons = notes[notes['nom'].duplicated(keep=False)]
print(doublons)

                   nom          matiere  note
0     Laurent Dagenais         Français    16
1           Guy Marois         Français    13
2      Beaufort Lesage         Français     8
3       Russell Durand         Français    10
4          Alexis Riel         Français    15
..                 ...              ...   ...
79    Agrican Foucault  Physique/Chimie     9
80  Prunella Josseaume  Physique/Chimie     6
81      Yseult Charest  Physique/Chimie    16
82      Dorothee Aupry  Physique/Chimie    17
83       Amaury Reault  Physique/Chimie     8

[84 rows x 3 columns]

In [31]:
moyenne_math = round(notes[notes['matiere'] == 'Mathématiques'].groupby('matiere').agg({'note':'mean'}), 2)

In [32]:
moyenne_math

                note
matiere
Mathématiques  11.33

In [34]:
moyenne_eleve = notes[['nom', 'note']].groupby('nom').mean()

In [35]:
moyenne_eleve

                     note
nom
Aceline Hughes      12.50
Agate Grandbois     14.25
Agramant Pepin      14.25
Agrican Foucault    11.50
Aiglentina Lambert   8.50
Alexis Riel          9.00
Amaury Reault        8.50
Beaufort Lesage     12.25
Byron Lefebvre      13.75
Dorothee Aupry      14.75
Florus Devoe        13.75
Gaston Brisette     13.50
Guy Marois          12.25
Laurent Dagenais    13.25
Leon Lapresse       12.25
Normand Arsenault   10.50
Orville Routhier     8.25
Prunella Josseaume  12.50
Russell Durand       8.50
Theodore Clavet      9.50
Yseult Charest      11.50

In [36]:
eleve_pas_moyenne = moyenne_eleve.loc[moyenne_eleve['note'] < 10]

In [38]:
eleve_pas_moyenne.shape[0]

6

In [39]:
notes_sup = pd.read_csv('notes_sup.csv')
notes_sup.head()

                nom              matiere  note
0  Laurent Dagenais  Histoire/Géographie    18
1        Guy Marois  Histoire/Géographie    13
2   Beaufort Lesage  Histoire/Géographie     8
3    Russell Durand  Histoire/Géographie    19
4       Alexis Riel  Histoire/Géographie    20

In [41]:
liste_notes= [notes, notes_sup]

notes2 = pd.concat(liste_notes, ignore_index=True)
notes2

                    nom   matiere  note
0      Laurent Dagenais  Français    16
1            Guy Marois  Français    13
2       Beaufort Lesage  Français     8
3        Russell Durand  Français    10
4           Alexis Riel  Français    15
..                  ...       ...   ...
121    Agrican Foucault   Anglais    10
122  Prunella Josseaume   Anglais    20
123      Yseult Charest   Anglais     7
124      Dorothee Aupry   Anglais    11
125       Amaury Reault   Anglais    12

[126 rows x 3 columns]

In [42]:
commande = pd.read_csv('commande.csv')
produits = pd.read_csv('produits.csv')
produits.head()
commande.head()

   id  nombre
0  70       2
1  41       4
2  72       2
3  92       8
4  73       1

In [43]:
produits.head()

   id  prix
0   0  24.8
1   1  13.1
2   2  23.7
3   3  16.0
4   4  19.0

In [54]:
commande['id'].unique().shape[0]

100

In [56]:
commande = commande.groupby('id').sum()
commande['nombre'].shape[0]

100

In [57]:
question_10 = produits.merge(commande, on='id', how='inner')
question_10.sort_values('nombre', ascending=False)

    prix  nombre
id
8   25.6     103
35  16.0      98
65  26.3      96
84  13.2      91
30  24.9      89
..   ...     ...
29  10.8      21
92   7.4      20
62  13.0      20
28  19.8      15
58  23.8       6

[100 rows x 2 columns]

In [58]:
question_10['CA'] = question_10['prix'] * question_10['nombre']
question_10.sort_values('CA', ascending=False)

    prix  nombre      CA
id
8   25.6     103  2636.8
65  26.3      96  2524.8
30  24.9      89  2216.1
19  31.6      67  2117.2
27  24.5      86  2107.0
..   ...     ...     ...
62  13.0      20   260.0
29  10.8      21   226.8
63   8.5      22   187.0
92   7.4      20   148.0
58  23.8       6   142.8

[100 rows x 3 columns]